//
//  Constants.swift
//  ToDoGardenUI
//
//  Created by SONG on 3/16/25.
//

// swiftlint:disable all
extension Constant.TermsTextView {
  public static let noticeTitle: String = "공지사항"
  public static let noticeContent: String = "* 공지사항이 없습니다 *"
  public static let termsOfServiceTitle: String = "투두가든 이용약관"
  public static let termsOfServiceContent: String =
  """
  본 약관은 투두가든(이하 ‘회사’라 함)이 제공하는 모든 상품 및 서비스(이하 ‘본 서비스’라 함)의 이용에 관한 조건에 대해 본 서비스를 이용하는 고객(이하 ‘고객’이라 함)과 당사간에 규정함을 목적으로 합니다.
  
  1. 정의
  2. 약관 동의
  3. 이용약관의 효력 및 개정
  4. 약관의 해석
  5. 회원가입
  6. 개인정보의 보호 및 사용
  7. 회원에 대한 통지 및 정보 제공
  8. 서비스의 이용 시간 및 중단
  9. 회사의 의무
  10. 회원의 의무
  11. 개인정보보호 의무
  12. 게시물의 저작권
  13. 회원 탈퇴 및 자격 상실
  14. 휴면ID 관리
  15. 손해배상
  16. 면책조항
  17. 약관의 해석 및 관할법원
  18. 재판관할 및 준거법
  19. 부칙 (시행일)
  
  1. 정의
  
  본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
  ① '회원'이라 함은 약관에 동의하고 '투두가든'이 제공하는 서비스를 이용하는 고객을 의미합니다.
  ② ‘로그인’이라 함은 회원의 이름, 이메일, 비밀번호 등의 로그인 정보를 통하여 서비스 신청 및 사용 중 서비스의 세부 정보를 확인하고 이용할 수 있는 행위를 말합니다.
  ③ '회원탈퇴'라 함은 회원이 서비스 이용을 해지하는 것을 말합니다.
  ④ 콘텐츠란 이미지, 동영상, 소프트웨어, 프로그램, 문장, 음성, 음악, 코드 기타 정보를 말합니다.
  ⑤ 개별 이용 약관이란 본 서비스에 관하여 본 약관과는 별도로 ‘약관’, 가이드라인’, ‘정책’ 등의 명칭으로 당사가 배포 또는 게시한 문서를 말합니다.
  이 약관에서 사용하는 용어 중 제1항에서 정하지 아니한 것은 관계 법령 및 서비스 별 안내에서 정하는 바에 따르며, 그 외에는 일반 관례에 따릅니다. 본 약관에서 사용하는 용어 중 조항에서 정의하지 않은 사항에 대해서는 관계법령에서 정하는 바에 따르고, 그 외에는 일반 관례에 따릅니다.
  
  2. 약관 동의
  
  고객은 본 약관의 규정에 따라 본 서비스를 이용해야 합니다.
  ① "서비스"라 함은 구현되는 단말기(PC, 스마트폰 등)와 상관없이 "회원"이 이용할 수 있는 '투두가든' 서비스를 의미합니다.
  ② 회원이라 함은 회사의 "서비스"에 접속하여 이 약관에 따라 "회사" 가 제공하는 "서비스"를 이용하는 고객을 말합니다.
  ③ "이용자ID" 또는 "회원ID"라 함은 회원의 식별과 회원의 서비스 이용을 위하여 구분하는 정보를 말합니다.
  3. 이용약관의 효력 및 개정
  고객은 본 약관의 규정에 따라 본 서비스를 이용해야 합니다.
  ① 이 약관은 서비스 화면에 게시하거나 기타의 방법으로 회원에게 공지함으로써 효력이 발생합니다.
  ② “회사”는 합리적인 사유가 발생할 경우 관련 법령에 위배되지 않는 범위 내에서 약관을 개정할 수 있습니다. 개정된 약관은 사이트를 통해 공지하거나 기타의 방법으로 “회원”에게 공지함으로써 그 효력이 발생하며, 이용자의 권리 또는 의무에 관한 변경은 최소한 7일 전에 공지합니다. 다만, '회원'에게 불리하게 약관 내용이 변경될 경우에는 30일 전에 공지합니다.
  ③ 변경된 약관에 대한 정보를 알지 못해 발생하는 회원의 피해는 '회사'에서 책임지지 않습니다.
  ④ "회원"은 변경된 약관에 대해 거부할 권리가 있습니다.
  ⑤ "회원"은 변경된 약관이 공지된 지 15일 이내에 거부의사를 표명할 수 있습니다. "회원"이 거부하는 경우 본 서비스 제공자인 "회사"는 15일의 기간을 정하여 "회원"에게 사전 통지 후 당해 "회원"과의 계약을 해지할 수 있습니다. 만약, "회원"이 거부 의사를 표시하지 않거나, 전항에 따라 시행일 이후에 "서비스"를 이용하는 경우에는 동의한 것으로 간주합니다.
  
  4. 약관의 해석
  
  ① 이 약관에서 규정하지 않은 사항에 관해서는 약관의 규제 등에 관한 법률, 전기통신기본법, 전기통신사업법, 정보통신망이용촉진등에 관한 법률 등의 관계법령에 따릅니다.
  ② "회원"이 "회사"와 개별계약을 체결하여 서비스를 이용하는 경우에는 개별계약이 우선합니다.
  
  5. 회원가입
  
  ① 5.1 이 약관의 동의는 회원가입 당시 절차 상의 이용약관 및 개인정보처리방침에 동의한다는 의사표시와 함께 회사가 요청하는 정보를 제공하여 회원가입 신청을 완료함으로써 이루어집니다.
  ② “회원”으로 가입하여 “서비스”를 이용하고자 하는 이용자는 “회사”에서 요청하는 제반 정보(개인정보처리방침 제 1항 ‘수집하는 개인정보의 항목’)를 제공하여야 합니다.
  ③ “회원”은 반드시 회원 본인의 정보를 제공하여야만 “서비스”를 이용할 수 있으며, 타인의 정보를 도용하거나 허위의 정보를 등록하는 등 본인의 정확한 정보를 등록하지 않은 “회원”은 “서비스” 이용과 관련하여 아무런 권리를 주장할 수 없으며, 관계 법령에 따라 처벌 받을 수 있습니다. 또한 제 3자에게 야기한 손해를 배상할 책임이 있으며, “회사”는 허위의 정보를 기재한 회원의 서비스 이용 자격을 제한할 수 있습니다.
  ④ “회사”'는 아래의 각 호에 해당하는 신청에 대해서는 승낙하지 않거나 사후에 이용계약을 해지할 수 있습니다. “회사”는 아래의 각 호에 해당하는 신청에 대해서는 승낙하지 않거나 사후에 이용계약을 해지할 수 있습니다.
  ㄱ. 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우
  ㄴ. 실명이 아니거나 타인의 명의를 이용한 경우
  ㄷ. 허위로 정보를 기재한 경우
  ㄹ. “회사”에서 정책에 적합하지 않은 “회원”으로 판단하여 “서비스” 제공이 곤란한 경우
  ㅁ. 부정한 용도로 “투두가든” 서비스를 이용하고자 하는 경우
  ㅂ. 14세 미만 아동이 정보통신망 이용촉진 및 정보보호 등에 관한 법률에서 정한 "개인정보" 입력 시 법정대리인(부모 등)의 동의를 얻지 아니한 경우
  ㅅ. 이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
  ㅇ. 기타 '회사'가 합리적인 판단에 의하여 이용계약 해지가 필요하다고 인정하는 경우
  
  6. 개인정보의 보호 및 사용
  
  ① “회사”는 관계 법령이 정하는 바에 따라 “회원”의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 관해서는 관계 법령 및 “회사”의 개인정보처리방침에 정한 바에 의합니다. 단, “회원”은 이용자ID 및 비밀번호 등이 타인에게 노출되지 않도록 철저히 관리해야 하며 “회사”는 “회원”의 귀책사유로 인해 노출된 정보에 대해서 책임을 지지 않습니다.
  ② “회사”는 고객이 제공하는 개인정보를 본 “서비스” 이외의 목적을 위하여 사용할 수 없습니다.
  ③ “회사”는 고객이 제공한 개인정보를 고객의 사전 동의 없이 제 3자에게 제공할 수 없습니다.
  
  7. 회원에 대한 통지 및 정보 제공
  
  ① “회사”가 특정 “회원”에 대하여 통지하는 경우 “회원”이 “회사”에 등록한 로그인 정보를 통해 개별 전달하는 방식으로 전달할 수 있습니다.
  ② “회사”는 불특정 다수 “회원”에게 통지를 해야 할 경우 공지게시판을 통해 7일 이전에 게시함으로써 개별 통지에 갈음할 수 있습니다.
  ③ “회사”는 “회원”에게 “서비스” 이용에 필요가 있다고 인정되는 각종 정보에 대해서 전자우편이나 서신, 우편, SMS, 전화 등의 방법으로 “회원”에게 제공할 수 있습니다.
  ④ “회사”는 서비스 개선 및 “회원” 대상의 서비스 소개 등의 목적으로 “회원”의 동의 하에 관련 법령에 따라 추가적인 개인 정보를 수집할 수 있습니다.
  
  8. 서비스의 이용 시간 및 중단
  
  ① “서비스” 이용은 “회사”의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간 운영을 원칙으로 합니다. 단, “회사”는 시스템 정기점검, 증설 및 교체를 위해 “회사”가 정한 날이나 시간에 “서비스”를 일시 중단할 수 있으며, 예정되어 있는 작업으로 인한 “서비스” 일시 중단은 고도를 통해 사전에 사이트를 통하여 공지합니다.
  ② “회사”는 긴급한 시스템 점검, 증설 및 교체, 설비의 장애, 서비스 이용의 폭주, 국가비상사태, 정전 등 부득이한 사유가 발생한 경우 사전 예고 없이 일시적으로 “서비스”의 전부 또는 일부를 중단할 수 있습니다.
  ③ “회사”는 서비스 개편 등 서비스 운영 상 필요한 경우 전부 또는 일부 서비스의 제공을 중단할 수 있으며 “회원”에게 사전 예고 또는 사후 통보 합니다.
  
  9. 회사의 의무
  
  ① “회사”는 본 약관이 정하는 바에 따라 지속적이고 안정적인 “서비스”를 제공하기 위해서 노력합니다.
  ② “회사”는 회원의 개인정보 보호를 위해 보안 시스템을 구축하며 개인정보 처리 방침을 공시하고 준수합니다.
  ③ “회사”는 공정하고 건전한 운영을 위해 최선을 다하고 지속적인 연구 개발을 통하여 양질의 서비스를 제공함으로써 고객 만족을 극대화하여 애플리케이션 사업 발전에 기여합니다.
  ④ “회사”는 “회원”으로부터 제기되는 의견이나 불편 사항이 정당하다고 객관적으로 인정될 경우에는 적절한 절차를 통해 즉시 처리하여야 합니다. 다만, 신속한 처리가 곤란한 경우는 “회원”에게 그 사유와 처리 일정을 통보하여야 합니다.
  
  10. 회원의 의무
  
  ① “회원”은 회원 가입 신청 또는 회원 정보 변경 시 모든 사항을 사실에 근거하여 본인의 실제 정보로 작성하여야 하며, 허위 또는 타인의 정보를 등록할 경우 이와 관련된 모든 권리를 주장할 수 없습니다.
  ② “회원”은 본 약관에서 규정하는 사항과 기타 “회사”가 정한 제반 규정, 공지사항 등 “회사”가 공지하는 사항 및 관계 법령을 준수하여야 하며, 기타 “회사”의 업무에 방해가 되는 행위, “회사”의 명예를 손상 시키는 행위, 타인에게 피해를 주는 행위를 해서는 안됩니다.
  ③ “회원”은 주소, 연락처, 전자우편 주소 등 “회원”의 이용정보가 변경된 경우에 해당 절차를 거쳐 이를 “회사”에 즉시 알려야 합니다.
  ④ “회원”은 회원 계정이 타인에게 노출되지 않도록 철저한 관리 책임이 있습니다.
  ⑤ “회원”은 회원 계정이 도난 당하거나 제 3자가 사용하고 있음을 인지한 경우에는 즉시 “회사”에 통보하고 “회사”의 안내가 있는 경우에는 그에 따라야 합니다.
  ⑥ “회원”은 서비스를 이용하는 중 리뷰를 작성함에 있어서 다른 유저에게 도움이 되지 못하는 정보나 다른 유저의 원활한 서비스 이용을 저해할 수 있다고 판단되는 경우 리뷰가 삭제될 수 있습니다. 예) 자음 또는 모음만으로 이루어진 리뷰, 다수의 유저들이 이해하기 어려울 것이라고 판단되는 리뷰, 욕설 등 불쾌할 수 있는 내용과 논란의 여지가 있는 리뷰 등
  ⑦ “회사”는 “회원”이 상기 고지된 내용을 위반하여 “회원”에게 발생한 손해에 대해 어떠한 책임도 갖지 않습니다.
  
  11. 개인정보보호 의무
  
  ① "회원이" "회사"의 "서비스"에 제공하는 정보 일체는 개인정보취급방침에 따르며, "회사"가 귀하의 정보를 수집 및 이용하는 행위는 동 정책에 따라 규율 됩니다. "회원"은 본 서비스를 이용함으로써 "회사"가 "회원"의 정보를 수집 및 이용(개인정보취급방침에서 규정하는 바와 같음)하는 것에 동의하는 것으로 간주된다는 사실을 인지하고 있습니다. "회원"에게 본 서비스를 제공하는 것의 일환으로, "회사"는 서비스 관련 공지사항 및 행정적 사안에 관한 메시지를 비롯한 전달사항을 제공할 필요가 있을 수 있습니다.
  ② "회원"은 본 서비스에서 사용하는 비밀번호와 관련된 모든 행동을 보호/관리해야 합니다. "회사"는 위 사항을 만족하지 못했을 때 일어난 어떠한 손실이나 피해에 대해 책임지지 않습니다.
  
  12. 게시물의 저작권
  
  ① "회원"이 서비스 내에 게시한 게시물의 저작권은 해당 게시물의 저작자에게 귀속됩니다.
  ② "회원"이 "서비스" 내에 게시하는 "콘텐츠"는 검색결과 내지 "서비스" 및 관련 프로모션 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다. 이 경우, 회사는 저작권법 규정을 준수하며, "회원"은 언제든지 고객센터 또는 "서비스" 내 관리기능을 통해 해당 게시물에 대해 삭제, 검색결과 제외, 비공개 등의 조치를 취할 수 있습니다.
  ③ "회사"는 제2항 이외의 방법으로 회원의 게시물을 이용하고자 하는 경우에는 전화, 팩스, 전자우편 등을 통해 사전에 회원의 동의를 얻어야 합니다.
  
  13. 회원 탈퇴 및 자격 상실
  
  이 약관에서 사용하는 용어 중 제1항에서 정하지 아니한 것은 관계 법령 및 서비스 별 안내에서 정하는 바에 따르며, 그 외에는 일반 관례에 따릅니다. 본 약관에서 사용하는 용어 중 조항에서 정의하지 않은 사항에 대해서는 관계법령에서 정하는 바에 따르고, 그 외에는 일반 관례에 따릅니다.
  고객은 본 약관의 규정에 따라 본 서비스를 이용해야 합니다.
  ① “회원”은 “회사”에 언제든지 회원 탈퇴를 요청할 수 있으며 “회사”는 요청을 받은 즉시 해당 “회원”의 회원 탈퇴를 위한 절차를 밟아 고도 개인정보처리방침에 따라 회원 등록을 말소합니다.
  ② “회사”의 서비스를 이용하는 “회원”이 탈퇴 요청하였을 경우 회원 탈퇴로 인한 서비스의 중지 또는 피해는 회원탈퇴 이용자에게 있습니다.
  ③ “회원”이 서비스 이용에 있어서 본 약관 제 10조 내용을 위반하거나, 다음 각 호의 사유에 해당하는 경우 “회사”는 직권으로 회원자격 상실 및 회원탈퇴의 조치를 할 수 있습니다.
  ④ 다른 사람의 명의를 사용하여 가입 신청한 경우
  ⑤ 신청 시 필수 작성 사항을 허위로 기재한 경우
  ⑥ 관계 법령의 위반을 목적으로 신청하거나 그러한 행위를 하는 경우
  ⑦ 사회의 안녕 질서 또는 미풍양속을 저해할 목적으로 신청하거나 그러한 행위를 하는 경우
  ⑧ 다른 사람의 “회사” 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우
  ⑨ 관계 법령 위배와 본 약관이 금지하는 행위를 하는 “회원” 경우
  ⑩ 회사가 직권으로 회원탈퇴 처리를 하고자 하는 경우에는 말소 전에 “회원”에게 소명의 기회를 부여합니다.
  
  14. 휴면ID 관리
  
  ① “회사”는 서비스 미 이용 및 1년 이상 사이트 로그인을 하지 않은 경우 해당 이용자ID 및 개인정보를 휴면ID로 별도 관리합니다.
  ② “회사”는 휴면ID 대상 “회원”에게 전환 30일 전에 고지의 의무를 다 해야 하며, 휴면ID를 이용하여 사이트 로그인 시도 시 회원가입 당시 요청한 제반 정보 확인 후 바로 이용자 ID로 전환이 이루어집니다.
  
  15. 손해배상
  
  ① “회사”는 서비스에서 무료로 제공하는 “서비스”의 이용과 관련하여 개인정보보호정책에서 정하는 내용에 해당하지 않는 사항에 대하여 어떠한 손해도 책임을 지지 않습니다.
  
  16. 면책조항
  
  ① “회사”는 천재지변, 전쟁, 기간통신사업자의 “서비스” 중지 및 기타 이에 준하는 불가항력으로 인하여 “서비스”를 제공할 수 없는 경우에는 “서비스” 제공에 대한 책임을 지지 않습니다.
  ② “회사”는 부득이한 사유로 발생한 회원의 손해에 대한 책임이 면제됩니다.
  ③ “회사”는 회원이 “서비스”에 게재한 정보, 자료, 사실의 정확성, 신뢰성 등 그 내용에 관하여는 어떠한 책임을 부담하지 아니하고, “회원”은 자기의 책임아래 “서비스”를 이용하며, “서비스”를 이용하여 게시 또는 전송한 자료 등에 관하여 손해가 발생하거나 자료의 취사선택, 기타 “서비스” 이용과 관련하여 어떠한 불이익이 발생하더라도 이에 대한 모든 책임은 “회원”에게 있습니다.
  ④ “회사”가 제공하는 정보와 자료는 거래의 목적으로 이용될 수 없습니다. 따라서 본 서비스의 정보와 자료 등에 근거한 거래는 전적으로 회원자신의 책임과 판단아래 수행되는 것이며, “회사”는 “회원”이 “서비스”의 이용과 관련하여 기대하는 이익에 관하여 책임을 부담하지 않습니다.
  ⑤ “회사”는 “회원”이 서비스를 이용하여 기대하는 수익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않으며, “서비스”를 이용하면서 얻은 자료로 인한 손해에 대하여 책임을 지지 않습니다.
  ⑥ “회사”는 “회원”의 게시물을 등록 전에 사전심사 하거나 상시적으로 게시물의 내용을 확인 또는 검토하여야 할 의무가 없으며, 그 결과에 대한 책임을 지지 아니합니다.
  
  17. 약관의 해석 및 관할법원
  
  ① 본 약관에 명시되지 않은 사항은 관계 법령과 상관례에 따릅니다.
  ② “회사”의 개별 유ㆍ무료 서비스 이용 회원의 경우 당해 서비스와 관련하여서는 “회사”가 별도로 정한 약관 및 정책에 따릅니다.
  ③ “회원”과 “회사” 사이에 발생한 분쟁에 대해 소송이 제기되는 경우 관할 법원은 서울중앙지방법원으로 합니다.
  
  18. 재판관할 및 준거법
  
  ① 이 약관에 명시되지 않은 사항은 대한민국의 관계법령과 상관습에 따릅니다.
  ② 이 약관 및 “서비스”의 이용과 관련된 분쟁에 관한 소송은 서울중앙지방법원 또는 민사소송법 상의 관할법원에 제기합니다.
  
  19. 부칙 (시행일)
  
  본 약관은 2025년 N월 N일부터 효력이 발생됩니다.
  """
  
  public static let privacyPolicyTitle: String = "개인정보 처리 방침"
  public static let privacyPolicyContent: String =
  """
  투두가든은 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.
  
  # 1. 개인정보의 처리 목적
  
  투두가든은 다음의 목적을 위하여 개인정보를 처리합니다.
  
  처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
  
  가. 회원가입 및 관리
  
  회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 각종 고지·통지 목적으로 개인정보를 처리합니다.
  
  나. 민원사무 처리
  
  민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락·통지, 처리결과 통보 등을 목적으로 개인정보를 처리합니다.
  
  다. 재화 또는 서비스 제공
  
  서비스 제공, 콘텐츠 제공, 맞춤 서비스 제공 등을 목적으로 개인정보를 처리합니다.
  
  라. 마케팅 및 광고에의 활용
  
  이벤트 및 광고성 정보 제공 및 참여기회 제공 , 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.
  
  # 2. 개인정보의 처리 및 보유 기간
  
  “투두가든”은 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.
  
  개인정보 처리 및 보유 기간은 다음과 같습니다.
  
  <회원가입 및 관리>
  
  - <회원가입 및 관리>와 관련한 개인정보는 수집.이용에 관한 동의일로부터 서비스 회원탈퇴 시 후 30일까지 원활한 서비스 관리와 이용을 위하여 보유, 이용됩니다.
  - 보유기간 : 탈퇴 시점으로부터 30일
  
  # 3. 정보주체와 법정대리인의 권리·의무 및 그 행사방법
  
  가. 정보주체는 투두가든에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.
  
  나. 제1항에 따른 권리 행사는 투두가든에 대해 「개인정보 보호법」 시행령 제41조제1항에 따라 서면, 전자우편 등을 통하여 하실 수 있으며 투두가든은(는) 이에 대해 지체 없이 조치하겠습니다.
  
  다. 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다.이 경우 “개인정보 처리 방법에 관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
  
  라. 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.
  
  마. 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.
  
  바. 투두가든은(는) 정보 주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.
  
  # 4. 처리하는 개인정보의 항목 작성
  
  고객은 본 약관의 규정에 따라 본 서비스를 이용해야 합니다.
  
  가. 투두가든은 사용자의 원활한 서비스 이용을 위해 다음의 개인정보 항목을 처리하고 있습니다.
  
  <재화 또는 서비스 제공>
  
  필수항목 : 애플 로그인 정보, 이메일, 로그인ID, 이름, 서비스 이용 기록, 방문 일시, 불량 이용 기록
  
  # 5. 개인정보의 파기
  
  가. 투두가든은(는) 개인정보 보유 기간의 경과, 처리 목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다
  
  나. 정보주체로부터 동의 받은 개인정보 보유 기간이 경과하거나 처리 목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관 장소를 달리하여 보존합니다.
  
  다. 개인정보 파기의 절차 및 방법은 다음과 같습니다.
  
  - 파기 절차 투두가든은(는) 파기 사유가 발생한 개인정보를 선정하고, 투두가든의 개인정보 보호 책임자의 승인을 받아 개인정보를 파기합니다.
  
  라. 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다. 종이에 출력된 개인정보는 분쇄기로 분쇄 하거나 소각을 통하여 파기합니다
  
  # 6. 개인정보의 안전성 확보 조치
  
  투두가든은(는) 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.
  
  가. 개인정보에 대한 접근 제한 개인정보를 처리하는 데이터 베이스 시스템에 대한 접근 권한의 부여,변경,말소를 통하여 개인정보에 대한 접근 통제를 위하여 필요한 조치를 하고 있으며 침입 차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
  
  나. 비인가자에 대한 출입 통제 개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입 통제 절차를 수립, 운영하고 있습니다.
  
  # 7. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항
  
  가. 투두가든은(는) 정보 주체의 이용 정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용하지 않습니다.
  
  # 8. 개인정보 보호책임자
  
  가. 투두가든은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호 책임자를 지정하고 있습니다.
  
  <개인정보 보호책임자>
  
  성명 : 홍승현
  
  직책 : Product Manager
  
  연락처 : [team.todogarden@gmail.com](mailto:team.todogarden@gmail.com)
  
  ※ 개인정보 보호 담당부서로 연결됩니다.
  """
}
// swiftlint:enable all
